//***********************************************************
// Набор процедур и функций для работы с сетью MicroLan
//
//#include "driverlib/MSP430FR5xx_6xx/driverlib.h"
#include <driverlib.h>
#include "delay.h"		// Задержки
#include "microlan.h"

//*****************************************************************/
// Глобальные переменные состояний поиска
//*****************************************************************/
//char rslt;
char LastDiscrepancy;		// Последнее несовпадение
char LastFamilyDiscrepancy;	// Последнее несовпадение группы
char LastDeviceFlag;			// Флаг последнего найденного устройства
unsigned char crc8, type;
unsigned char ROM_NO[11];	// буфер для поиска приборов
unsigned char DEV_NUM[8][17];
//****** Структура массива DEV_NUM **********
/*	Первый индекс ([8])- номер/количество прибора/ов в сети
	Второй индекс:	[0]		- код прибора
					[1]~[7] - адрес прибора в сети,
					[8],[9] - значение температуры (8-младшее,9-старшее)
					[10]	- Контроль максимального предела
					[11]	- Контроль минимального предела
					[12]	- Регистр конфигурации
*/
extern unsigned char list_ds[2][13]; // "Список найденных приборов" и параметры размещения в "Таблице приборов"
unsigned int zad;
/*
********************************************************************************
*               Designate the delay
*
* Описание  : Wait for 1 microsecond
* Аргументы :  cnt - time to wait
* Returns     : None
* Примечание  : Internal Function, System Dependant
********************************************************************************
* /
void wait_1us(int cnt)
{
unsigned int i;

	for (i = 0; i < (cnt*2); i++) ;
}
// */
//****************************************/
// СТАНДАРТНЫЕ 1-но ПРОВОДНЫЕ ПРОЦЕДУРЫ.

//**************************************************************************
char MicroLanNetwork (void)
{
//**************************************************************************
// Ищем ВСЕ устройства MicroLan:
signed char i,dvc=0;
signed char n,j;
///////////////////////////////////////////////////////////////////////////////////
//	PutStringLn("Ищем приборы в сети MicroLan:");
///////////////////////////////////////-12345678901234567890--/////////////////////
//	PutString485("Приборы MicroLan: ");
//	OWFirst();
    for(n=0;n<16;n++){                              // Чистим таблицу приборов.
        for(j=0;j<13;j++)list_ds[n][j]=0;           //
    }    
//*	seach_DS1820();
	  OWTargetSetup(0x28);	    //Настраиваемся на поиск прибора
	  while (OWNext()){
		  if(ROM_NO[0] == 0x28){  // формируем таблицу приборов DS18B20
			  for (i = 7; i >= 0; i--)list_ds[dvc][i]=ROM_NO[i];
			  dvc++;			    //Подсчитываем найденные приборы.
		  }
	  }
    return dvc;
}
//**************************************************************************
//**************************************************************************
//**************************************************************************
// Поиск "Первого" устройства на шине 1-Wire
// Возврат TRUE  : Устройство найдено, Адрес сохранен в буфере ROM_NO
//         FALSE : Устройство отсутствует
//
char OWFirst(void)
{
	// Переменные поиска в 0:
	LastDiscrepancy = 0;
	LastDeviceFlag = FALSE;
	LastFamilyDiscrepancy = 0;
return OWSearch();
}

//**************************************************************************
// Ищем "Следуюшие" устройства на шине 1-Wire
// Возврат TRUE  : Устройство найдено, Адрес сохранен в буфере ROM_NO
//         FALSE : Устройство не найдено, конец поиска
//
char OWNext(void)
{
	// оставляем сотояние поиска в покое - leave the search state alone
	return OWSearch();
}
//**************************************************************************/
// Выполняет Алгоритм Поиска Устройств на шине 1-Wire
// используя существующее состояние поиска.
// Возврат TRUE  : Устройство найдено, номер ROM в буфере ROM_NO
//         FALSE : Устройство не найдено, конец поиска
//
char OWSearch(void)
{
char id_bit_number;
char last_zero, rom_byte_number, search_result;
char id_bit, cmp_id_bit;
unsigned char rom_byte_mask, search_direction;

	// Инициализация поиска
	id_bit_number = 1;
	last_zero = 0;
	rom_byte_number = 0;
	rom_byte_mask = 1;
	search_result = 0;
	crc8 = 0;

    if(!LastDeviceFlag)// Если последний вызов не был последним
    {
        if(!OWReset()) // Сбрасываем 1-Wire
        {
			LastDiscrepancy = 0;		// Сбрасываем переменные поиска
			LastDeviceFlag = FALSE;
			LastFamilyDiscrepancy = 0;
			return FALSE;
		}
        wait_1us(1);         // Пауза
        OWWriteByte(0xF0);				// Запускаем команду поиска
        do								// Выполняем цикл поиска
        {
            id_bit = OWReadBit();		// читаем бит и его дополнение
            cmp_id_bit = OWReadBit();

            if ((id_bit == 1) && (cmp_id_bit == 1)) break;// Проверка на отсутствие устройств на шине 1-wire

            else		// Все устройства в сети могут иметь 0 или 1
            {
                if (id_bit != cmp_id_bit) search_direction = id_bit; // записываем значение бита для поиска
					// ^-- В данной ситуации последовательность может быть 01 или 10.
                else	// Если просходит несовпадение перед последним несовпадением (Last Discrepancy)
                {		// предыдущего, то следующим выбераем такой же как в последней проверке
                    if (id_bit_number < LastDiscrepancy) 
						 search_direction = ((ROM_NO[rom_byte_number] & rom_byte_mask) > 0);
                    else search_direction = (id_bit_number == LastDiscrepancy); // если последний ответ равен, то выбираем 1
																				// если нет, то потом выберем 0

                    if (search_direction == 0)	// Если получился 0, то записывается его позиция в LastZero
                    {
                        last_zero = id_bit_number; //
                        if (last_zero < 9)		// check for Last discrepancy in family
                        LastFamilyDiscrepancy = last_zero;
                    }
                }
                // Устанавливаем или очищаем бит rom_byte_number в ROM
                // используя маску rom_byte_mask
                if (search_direction == 1) ROM_NO[rom_byte_number] |= rom_byte_mask;
                else ROM_NO[rom_byte_number] &= ~rom_byte_mask;

                OWWriteBit(search_direction);	// записываем бит для поиска серийного номера
                id_bit_number++;		// Инкрементируем счетчик быйтов id_bit_number
                rom_byte_mask <<= 1;	// и перемещаем маску rom_byte_mask

                if (rom_byte_mask == 0)	// Если маска = 0, переходим на новый байт Серийного номера rom_byte_number
                {						// и сбрасываем маску
                    docrc8(ROM_NO[rom_byte_number]); // Накапливаем CRC
                    rom_byte_number++;
                    rom_byte_mask = 1;
                }
            }//конец else
        } while(rom_byte_number < 8); // Выполняем цикл для всех байтов ROM bytes 0-7

        // Если поиск выполнен успешно, тогда:
        if (!((id_bit_number < 65) || (crc8 != 0)))
        {
            // Поиск завершен успешно, устанавливаем значения для LastDiscrepancy,LastDeviceFlag,search_result
            LastDiscrepancy = last_zero;
            if (LastDiscrepancy == 0) LastDeviceFlag = TRUE; // Проверяем - было-ли устройство последним
			search_result = TRUE;	// Устанавливаем флаг, что поиск прошел успешно.
        }
    }// end     if (!LastDeviceFlag)

	if (!search_result || !ROM_NO[0])	// Если устройство не найдено, то сбрасываем счетчики
	{									// и следующий поиск будет выполняться как первый (First)
		LastDiscrepancy = 0;
		LastDeviceFlag = FALSE;
		LastFamilyDiscrepancy = 0;
		search_result = FALSE;
	}

	return search_result;
}
//*/
//**************************************************************************
// Проверяет номер устройства с номером в буфере ROM_NO.
// Return TRUE  : Сравниваемое устройство присутствует
//        FALSE : устройство отсутствует
//
char OWVerify(void)
{
unsigned char rom_backup[8];
char i,rslt,ld_backup,ldf_backup,lfd_backup;

	// Сохраняем backup копию текущего состояния
	for (i = 0; i < 8; i++)
		rom_backup[i] = ROM_NO[i];

	ld_backup = LastDiscrepancy;
	ldf_backup = LastDeviceFlag;
	lfd_backup = LastFamilyDiscrepancy;

	// Настраиваем поиск, чтобы найти такое же устройство
	LastDiscrepancy = 64;
	LastDeviceFlag = FALSE;

	if (OWSearch())
	{
		// Проверяем, если такое же устройство найдено
		rslt = TRUE;
		for (i = 0; i < 8; i++)
		{
			if (rom_backup[i] != ROM_NO[i])
			{
				rslt = FALSE;
				break;
			}
		}
	}
	else
		rslt = FALSE;

	// Восстанавливаем состояние поиска
	for (i = 0; i < 8; i++)
		ROM_NO[i] = rom_backup[i];

	LastDiscrepancy = ld_backup;
	LastDeviceFlag = ldf_backup;
	LastFamilyDiscrepancy = lfd_backup;

	// return результат сравнения
	return rslt;
}
//**************************************************************************
// Настраиваем поиск устройства по типу 'family_code
// следующим вызовом OWNext(), если оно присутствует.
//
void OWTargetSetup(unsigned char family_code)
{
char i;
	// Настраиваем состояние на поиск SearchFamily типа устройств
	ROM_NO[0] = family_code;

	for (i = 1; i < 8; i++)
		ROM_NO[i] = 0;

	LastDiscrepancy = 64;     // Последнее Несовпавшие разряды
	LastFamilyDiscrepancy = 0;// Последнее НЕСОВПАДЕНИЕ ГРУППЫ
	LastDeviceFlag = FALSE;   // 
}

//**************************************************************************/
// Настройка поиска, чтобы пропускать текущий тип устройства на следующем
// вызове OWNext().
//
void OWFamilySkipSetup(void)
{
	// Устанавливаем Last discrepancy (Последнее несходство)
	// в последнюю группу несовпадений
	LastDiscrepancy = LastFamilyDiscrepancy;
	LastFamilyDiscrepancy = 0;

	// Проверяем конец списка - check for end of list
	if (LastDiscrepancy == 0)
		LastDeviceFlag = TRUE;
}
//**************************************************************************
//**************************************************************************
//
// 1-Wire Functions, привязанные к специфике процессора (платформе)
//
//**************************************************************************
//#define KOEF      50    // !!! Это для ПРОТЕУСа
//#define KOEF      100    //  25    Это для Реального процессора
//**************************************************************************
//#define IMP_LONG 45 * KOEF/10     // 450
#define IMP_LONG 20                 //
//#define IMP_SHOT 6  * KOEF/10     // 60
#define IMP_SHOT 2                  //
//#define IMP_RST  800* KOEF/10     // 8000
#define IMP_RST  250                //
//#define IMP_OTV  10 * KOEF/10     // 100
#define IMP_OTV  2                  //
int res_ml;
//**************************************************************************
// Сбрасываем шину 1-Wire и определяем наличие любого устройства
// Return TRUE  : Устройство присутствует
//        FALSE : Устройство отсутствует
//
char OWReset(void)
{
signed int i;
char y=0;
    PJOUT |= BIT2;                          // DRIVE = 1;
    //__delay_cycles(480);                  // выполняем паузу (ждем включения внешнего питания)
    __delay_cycles(600);                  // выполняем паузу (ждем включения внешнего питания)
    PJOUT &= ~BIT2;                         // DRIVE = 0;
    __delay_cycles(5);                  // выполняем паузу (ждем включения внешнего питания)
	i=0; 
	while(i < IMP_RST){                     // Ждем Импульс Присутствия 500мкс. Через 50мкс смотрим на SENSE.
	    res_ml = PJIN & 0x08;               // читаем ножку SENSE
		if((i>=IMP_OTV)&&(res_ml==0)){
		    y=1;  // Есть ответ от прибора-фиксируем.
    PJOUT |= BIT2;                          // DRIVE = 1;
		    break;
		}
		i++;
	}
    //__delay_cycles(250);                  // выполняем паузу (ждем включения внешнего питания)
    __delay_cycles(300);                  // выполняем паузу (ждем включения внешнего питания)
    PJOUT &= ~BIT2;                         // DRIVE = 0;
	return y;
}
//**************************************************************************/
// Посылаем 8 битов данных на шину 1-Wire.
//
void OWWriteByte(unsigned char byte_value)
{
unsigned char n;

	for (n=0; n<8; n++){
		if((byte_value & 0x01)==0)  OWWriteBit(0);  // Запись "0"
	    else                        OWWriteBit(1);  // Запись "1"
   		byte_value = byte_value >> 1; 
   }
}
//**************************************************************************/
// Посылаем 1 бит данных на шину 1-Wire.
//
void OWWriteBit(unsigned char bit_value)
{

    if (bit_value == 0){            // write_0();// всего ~ 125мкс
	        PJOUT |= BIT2;                      //Запись НУЛЯ!!! - DRIVE = 1;
		   	// Пауза ~ 110мкс
	        __delay_cycles(100);                // формируем импульс
	        PJOUT &= ~BIT2;                     //  DRIVE = 0;
 		   	// Импульс ~ 13мкс
            __delay_cycles(2);                  // отпускаем шину, начинает работать подтяжка кверху
	}
	else{                           //write_1();// всего ~ 120мкс
	        PJOUT |= BIT2;                      // DRIVE = 1;
            // Импульс в 8,5мкс
            __delay_cycles(15);                 // формируем импульс
		   	PJOUT &= ~BIT2;                     // DRIVE = 0;
            // Пауза ~ 110мкс
	        __delay_cycles(85);                 // отпускаем шину, начинает работать подтяжка кверху
	}
}
//**************************************************************************
// Читает 1 бит данных с шины 1-Wire
// Return 1 : Прочитана 1
//        0 : прочитан 0
//
unsigned char OWReadBit(void)
{
    PJOUT |= BIT2;                      // DRIVE = 1;
    // Импульс в 10мкс
    __delay_cycles(5);                  //
    PJOUT &= ~BIT2;                     // DRIVE = 0; отпускаем шину
    // пауза...
    __delay_cycles(10);                 // выполняем паузу перед чтением
    //
    res_ml = PJIN & 0x08;               // читаем ножку SENSE PJ.3
    if (res_ml == 0){        // Чтение "0"
        // Пауза ~ 100мкс
	    __delay_cycles(62);             // выполняем паузу...
        return 0; //
    }
    else {                  // Чтение ЕДИНИЦЫ.
        // Пауза ~ 100мкс
	    __delay_cycles(62);             // выполняем паузу...
        return 1; //
    }
}
//**************************************************************************/
// Читает 1 байт данных с шины 1-Wire
// Return  : Значение Байта
//
unsigned char OWReadByte(void)
{
unsigned char n, tmp=0;

    for (n=0; n<7; n++){
        if(OWReadBit()==1) tmp+=0x80;
        tmp = tmp >> 1;         // Младший бит заходит первым !!!
    }
    if(OWReadBit()==1) tmp+=0x80;
return tmp;
}
/*
// **************************************** /
// TEST BUILD
static unsigned char dscrc_table[] = {
//const unsigned char dscrc_table[] = {
0, 94,188,226, 97, 63,221,131,194,156,126, 32,163,253, 31, 65,
157,195, 33,127,252,162, 64, 30, 95, 1,227,189, 62, 96,130,220,
35,125,159,193, 66, 28,254,160,225,191, 93, 3,128,222, 60, 98,
190,224, 2, 92,223,129, 99, 61,124, 34,192,158, 29, 67,161,255,
70, 24,250,164, 39,121,155,197,132,218, 56,102,229,187, 89, 7,
219,133,103, 57,186,228, 6, 88, 25, 71,165,251,120, 38,196,154,
101, 59,217,135, 4, 90,184,230,167,249, 27, 69,198,152,122, 36,
248,166, 68, 26,153,199, 37,123, 58,100,134,216, 91, 5,231,185,
140,210, 48,110,237,179, 81, 15, 78, 16,242,172, 47,113,147,205,
17, 79,173,243,112, 46,204,146,211,141,111, 49,178,236, 14, 80,
175,241, 19, 77,206,144,114, 44,109, 51,209,143, 12, 82,176,238,
50,108,142,208, 83, 13,239,177,240,174, 76, 18,145,207, 45,115,
202,148,118, 40,171,245, 23, 73, 8, 86,180,234,105, 55,213,139,
87, 9,235,181, 54,104,138,212,149,203, 41,119,244,170, 72, 22,
233,183, 85, 11,136,214, 52,106, 43,117,151,201, 74, 20,246,168,
116, 42,200,150, 21, 75,169,247,182,232, 10, 84,215,137,107, 53};

// **************************************************************************
// Calculate the CRC8 of the byte value provided with the current
// global 'crc8' value.
// Returns current global crc8 value
//
unsigned char docrc8(unsigned char value)
{
	// See Application Note 27
	// TEST BUILD
	crc8 = dscrc_table[crc8 ^ value];
	return crc8;
}
// */
//*******************************************************************************************/
//*******************************************************************************************/
//*******************************************************************************************/
//*********************************************************************/
#pragma PERSISTENT(crc8_table)
unsigned char crc8_table[] = {
//static unsigned char crc8_table[] = {
//const unsigned char crc8_table[] = {
0, 94,188,226, 97, 63,221,131,194,156,126, 32,163,253, 31, 65,
157,195, 33,127,252,162, 64, 30, 95, 1,227,189, 62, 96,130,220,
35,125,159,193, 66, 28,254,160,225,191, 93, 3,128,222, 60, 98,
190,224, 2, 92,223,129, 99, 61,124, 34,192,158, 29, 67,161,255,
70, 24,250,164, 39,121,155,197,132,218, 56,102,229,187, 89, 7,
219,133,103, 57,186,228, 6, 88, 25, 71,165,251,120, 38,196,154,
101, 59,217,135, 4, 90,184,230,167,249, 27, 69,198,152,122, 36,
248,166, 68, 26,153,199, 37,123, 58,100,134,216, 91, 5,231,185,
140,210, 48,110,237,179, 81, 15, 78, 16,242,172, 47,113,147,205,
17, 79,173,243,112, 46,204,146,211,141,111, 49,178,236, 14, 80,
175,241, 19, 77,206,144,114, 44,109, 51,209,143, 12, 82,176,238,
50,108,142,208, 83, 13,239,177,240,174, 76, 18,145,207, 45,115,
202,148,118, 40,171,245, 23, 73, 8, 86,180,234,105, 55,213,139,
87, 9,235,181, 54,104,138,212,149,203, 41,119,244,170, 72, 22,
233,183, 85, 11,136,214, 52,106, 43,117,151,201, 74, 20,246,168,
116, 42,200,150, 21, 75,169,247,182,232, 10, 84,215,137,107, 53};

//*********************************************************************/
// Подсчет контрольной суммы по полиному CRC = x^8+x^5+x^4+1
unsigned char CRC8(unsigned char* buf, unsigned char size)
{
unsigned char c = 0;
unsigned char* adr;

    for(adr = buf; size--; adr++)
        c = crc8_table[c ^ *adr];
    return c;
}
//**************************************************************************/
//****** Структура базы DS18B20 **********
//
//  [0]     - Код прибора;
//  [1]~[7] - Адрес прибора в сети;
//  [8]     - Значение температуры (Мл.байт)
//  [9]     - Значение температуры (Ст.байт)
//  [10]    - Верхний порог температуры;
//  [11]    - Нижний порог температуры;
//  [12]    - Регистр конфигурации
//
//**************************************************************************/
//      Карта памяти термометров DS18B20:
//
//  байт0   Значение температуры (Мл.байт)
//  байт1   Значение температуры (Ст.байт)
//  байт2   Верхний порог температуры (сохраняется в EEPROM DS18B20)
//  байт3   Нижний порог температуры (сохраняется в EEPROM DS18B20)
//  байт4   Регистр конфигурации (сохраняется в EEPROM DS18B20)
//  байт5   Неиспользуется (всегда 0хFF)
//  байт6   Неиспользуется (всегда 0х0C)
//  байт7   Неиспользуется (всегда 0х10)
//  байт8   Контрольная сумма CRC
//
//****************************************************************
// Измерение температуры если в сети несколько приборов
// *После команды на изм.температуры, нужно ждать не менее 0,5 сек.
// параметр mode==0 - читается измерение
// параметр mode==1 - посылается команда на измерение
//
//****** Структура базы DS18B20 **********
//
//  [0]     - Код прибора;
//  [1]~[7] - Адрес прибора в сети;
//  [8]     - Значение температуры (Мл.байт)
//  [9]     - Значение температуры (Ст.байт)
//  [10]    - Верхний порог температуры;
//  [11]    - Нижний порог температуры;
//  [12]    - Регистр конфигурации
//
char Loop_DS1820_M(unsigned char mode)
{
  char in_ds_sensor;

    in_ds_sensor = OWReset();             // Сбрасываем прибор,
    if (in_ds_sensor == 0) return 11;     // Если приборы отсутствуют, выходим

    if(mode==0){  // Режим чтения измеренных значений.

              OWWriteByte(0xCC);                    // Команда "Пропуск Адреса"
              OWWriteByte(0xBE);                    // Команда "Читать температуру"
              ROM_NO[0] = OWReadByte();   // и второй.
              ROM_NO[1] = OWReadByte();   // Читаем Первый байт
              ROM_NO[2] = OWReadByte();   // Читаем 3 байт
              ROM_NO[3] = OWReadByte();   // Читаем 4 байт
              ROM_NO[4] = OWReadByte();   // Читаем 5 байт
              ROM_NO[5] = OWReadByte();   // Читаем 6 байт
              ROM_NO[6] = OWReadByte();   // Читаем 7 байт
              ROM_NO[7] = OWReadByte();   // Читаем 8 байт
              ROM_NO[8] = OWReadByte();   // Читаем 9 байт
              in_ds_sensor = CRC8(&ROM_NO[0], 9);// Формируем Контрольную сумму CRC8
              __no_operation();

    }
    else if(mode==1){   // Запускаем измерение температуры.

              OWWriteByte(0xCC);                    // Команда "Пропуск Адреса"
              OWWriteByte(0x44);                    // Команда "Читать температуру"
              in_ds_sensor =0;
    }
// После команды на изм.температеры, нужно ждать не менее 0,5 сек.
  return in_ds_sensor;

}


